In [4]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame
columns = ["数学","英语","语文","理科综合"]
index = ["211","985","一本","二本","top2","c9"]
data = {
    "数学":[125,135,120,110,145,111],
    "英语":[123,143,145,124,146,114],
    "语文":[135,112,134,132,90,98],
    "理科综合":[223,245,213,189,258,222]
}
# index不写默认数字索引
frame = DataFrame(data=data,columns=columns,index=index)

In [5]:
frame

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>数学</th>
      <th>英语</th>
      <th>语文</th>
      <th>理科综合</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>211</th>
      <td>125</td>
      <td>123</td>
      <td>135</td>
      <td>223</td>
    </tr>
    <tr>
      <th>985</th>
      <td>135</td>
      <td>143</td>
      <td>112</td>
      <td>245</td>
    </tr>
    <tr>
      <th>一本</th>
      <td>120</td>
      <td>145</td>
      <td>134</td>
      <td>213</td>
    </tr>
    <tr>
      <th>二本</th>
      <td>110</td>
      <td>124</td>
      <td>132</td>
      <td>189</td>
    </tr>
    <tr>
      <th>top2</th>
      <td>145</td>
      <td>146</td>
      <td>90</td>
      <td>258</td>
    </tr>
    <tr>
      <th>c9</th>
      <td>111</td>
      <td>114</td>
      <td>98</td>
      <td>222</td>
    </tr>
  </tbody>
</table>
</div>

In [7]:
frame.values

array([[125, 123, 135, 223],
       [135, 143, 112, 245],
       [120, 145, 134, 213],
       [110, 124, 132, 189],
       [145, 146,  90, 258],
       [111, 114,  98, 222]], dtype=int64)

In [8]:
frame.columns

Index(['数学', '英语', '语文', '理科综合'], dtype='object')

In [9]:
frame.shape

(6, 4)

In [10]:
frame.size

24

In [6]:
# 取出元素
frame.iloc[0][0]

125

In [7]:
frame["数学"][0]

125

In [16]:
# 取出行
frame.ix[0]

数学      125
英语      123
语文      135
理科综合    223
Name: 211, dtype: int64

In [13]:
frame.iloc[0]

数学      125
英语      123
语文      135
理科综合    223
Name: 211, dtype: int64

In [15]:
frame.ix[0:3]

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>数学</th>
      <th>英语</th>
      <th>语文</th>
      <th>理科综合</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>211</th>
      <td>125</td>
      <td>123</td>
      <td>135</td>
      <td>223</td>
    </tr>
    <tr>
      <th>985</th>
      <td>135</td>
      <td>143</td>
      <td>112</td>
      <td>245</td>
    </tr>
    <tr>
      <th>一本</th>
      <td>120</td>
      <td>145</td>
      <td>134</td>
      <td>213</td>
    </tr>
  </tbody>
</table>
</div>

In [18]:
# 取出多列
frame[["数学","语文"]]

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>数学</th>
      <th>语文</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>211</th>
      <td>125</td>
      <td>135</td>
    </tr>
    <tr>
      <th>985</th>
      <td>135</td>
      <td>112</td>
    </tr>
    <tr>
      <th>一本</th>
      <td>120</td>
      <td>134</td>
    </tr>
    <tr>
      <th>二本</th>
      <td>110</td>
      <td>132</td>
    </tr>
    <tr>
      <th>top2</th>
      <td>145</td>
      <td>90</td>
    </tr>
    <tr>
      <th>c9</th>
      <td>111</td>
      <td>98</td>
    </tr>
  </tbody>
</table>
</div>